kirikak2/midori/sdkconfig.defaults.freenove
# Freenove ESP32-S3 specific settings
#
# Board settings only. The USB port mode (USB-MIDI host / USB serial /
# USB-MIDI device) lives in sdkconfig.defaults.usbmode.*, which
# switch_board.sh appends to this file.
CONFIG_USB_MIDI_BOARD_FREENOVE=y

# Target
CONFIG_IDF_TARGET="esp32s3"

# Custom partition table
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Freenove ESP32-S3 WROOM N8R8 has 8MB flash. Needed for the coredump
# partition, which sits beyond the first 2MB - the 2MB default rejects
# partitions.csv outright. Raise to 16MB on an N16R8 module.
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Enable PSRAM (Octal mode for Freenove)
CONFIG_SPIRAM=y
# CONFIG_SPIRAM_MODE_QUAD is not set
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y

# Use PSRAM for memory allocation - place BSS in PSRAM
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=16384
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Compiler optimization for size
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# USB-OTG settings - increase transfer size for large Configuration descriptors
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=4096

# Brownout detection level
# Level 6 (2.87V) instead of default 7 (3.08V) to prevent false triggers
# during USB device operation which can cause temporary voltage drops
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_6=y
CONFIG_ESP_BROWNOUT_DET_LVL=6
